{"source": "Summarize this text: The quick brown fox jumped over the lazy dog", "target": "The fox jumped over the lazy dog."}
{"source": "Summarize this text: The quick brown fox jumped over the lazy dog", "target": "The quick fox jumped over the lazy dog."}
{"source": "Summarize this text: The quick brown fox jumped over the lazy dog", "target": "The brown fox jumped over the lazy dog."}
{"source": "<html> </html>", "target": "Creates an HTML document"}
{"source": "<head> </head>", "target": "Sets off the title & other info that isn't displayed"}
{"source": "<body> </body>", "target": "Sets off the visible portion of the document"}
{"source": "<title> </title>", "target": "Puts name of the document in the title bar; when bookmarking pages, this is what is bookmarked"}
{"source": "<body bgcolor=?>", "target": "Sets background color, using name or hex value"}
{"source": "<body text=?>", "target": "Sets text color, using name or hex value"}
{"source": "<body link=?>", "target": "Sets color of links, using name or hex value"}
{"source": "<pre> </pre>", "target": "Creates preformatted text"}
{"source": "<h1> </h1> --> <h6> </h6>", "target": "Creates headlines -- H1=largest, H6=smallest"}
{"source": "<b> </b>", "target": "Creates bold text (should use <strong> instead)"}
{"source": "<i> </i>", "target": "Creates italicized text (should use <em> instead)"}
{"source": "<tt> </tt>", "target": "Creates typewriter-style text"}
{"source": "<code> </code>", "target": "Used to define source code, usually monospace"}
{"source": "<cite> </cite>", "target": "Creates a citation, usually processed in italics"}
{"source": "<address> </address>", "target": "Creates address section, usually processed in italics"}
{"source": "<em> </em>", "target": "Emphasizes a word (usually processed in italics)"}
{"source": "<strong> </strong>", "target": "Emphasizes a word (usually processed in bold)"}
{"source": "<font size=?> </font>", "target": "Sets size of font - 1 to 7 (should use CSS instead)"}
{"source": "<font color=?> </font>", "target": "Sets font color (should use CSS instead)"}
{"source": "<font face=?> </font>", "target": "Defines the font used (should use CSS instead)"}
{"source": "Make a HTML site", "target": ""}
{"source": "Create a basic HTML site", "target": "Creates an HTML document"}
{"source": "Create a HTML site with a head section", "target": "Sets off the title & other info that isn't displayed"}
{"source": "Create a HTML site with a body section", "target": "Sets off the visible portion of the document"}
{"source": "Create a HTML site with a title", "target": "Puts name of the document in the title bar; when bookmarking pages, this is what is bookmarked"}
{"source": "Create a HTML site with a background color", "target": "Sets background color, using name or hex value"}
{"source": "Create a HTML site with text color", "target": "Sets text color, using name or hex value"}
{"source": "Create a HTML site with link color", "target": "Sets color of links, using name or hex value"}
{"source": "Create a HTML site with preformatted text", "target": "Creates preformatted text"}
{"source": "Create a HTML site with headlines", "target": "Creates headlines -- H1=largest, H6=smallest"}
{"source": "Create a HTML site with bold text", "target": "Creates bold text (should use <strong> instead)"}
{"source": "Create a HTML site with italic text", "target": "Creates italicized text (should use <em> instead)"}
{"source": "Create a HTML site with typewriter-style text", "target": "Creates typewriter-style text"}
{"source": "Create a HTML site with code section", "target": "Used to define source code, usually monospace"}
{"source": "Create a HTML site with citation", "target": "Creates a citation, usually processed in italics"}
{"source": "Create a HTML site with address section", "target": "Creates address section, usually processed in italics"}
{"source": "Create a HTML site with emphasized text", "target": "Emphasizes a word (usually processed in italics)"}
{"source": "Create a HTML site with strong text", "target": "Emphasizes a word (usually processed in bold)"}
{"source": "Create a HTML site with font size", "target": "Sets size of font - 1 to 7 (should use CSS instead)"}
{"source": "Create a HTML site with font color", "target": "Sets font color (should use CSS instead)"}
{"source": "Create a HTML site with font face", "target": "Defines the font used (should use CSS instead)"}
{"source": "How can I wake up my dormant creativity?", "target": "It’s easy to wake up your creativity by using practical techniques to stimulate your imagination, such as play, storytelling, drawing, photography, and visualization."}
{"source": "What is a good mindset for creativity?", "target": "Look at creativity as a process rather than a product. Focus on exploration and imagination rather than results."}
{"source": "How can adults keep their innate curiosity alive?", "target": "Maintain flexibility of mind, give yourself time to play, and practice creative exercises daily."}
{"source": "What are practical steps to spark creativity?", "target": "Spend 15 minutes a day on creative practices like drawing, telling stories, writing, taking photos, or making visualizations."}
{"source": "What does brain science say about creativity?", "target": "The right brain needs stimulation, while the left brain often needs quiet time to process ideas, helping both creativity and innovation."}
{"source": "Why is creativity important in professional life?", "target": "Creativity is key to success in all professions and also helps individuals feel more fulfilled, relaxed, and happier."}
{"source": "How can adults retrieve a childlike sense of wonder?", "target": "By engaging in playful creativity and not fearing mistakes, adults can reconnect with their innate curiosity and enhance their quality of life."}
{"source": "How does collaboration affect creativity?", "target": "Collaborating with others can enhance originality and provide new ideas, building on each other's creative or innovative concepts."}
{"source": "Should creativity always lead to financial success?", "target": "No. Focus on enjoying the creative process itself rather than outcomes like financial gain."}
{"source": "What do CEOs say about creativity?", "target": "According to an IBM survey of over 1,500 CEOs, successfully navigating a complex world requires creativity more than rigor, discipline, integrity, or vision."}
{"source": "Can simple activities boost creativity?", "target": "Yes. Activities like doodling or stepping away from smartphones can improve memory retention and spark new ideas."}
{"source": "Wake up your creativity", "target": "Draw a quirky creature that doesn’t exist, tell its story, and imagine what it eats for breakfast."}
{"source": "Use play to stimulate imagination", "target": "Pretend your office chair is a spaceship and write a one-page mission log about your intergalactic adventures."}
{"source": "Practice creative visualization", "target": "Close your eyes and imagine a tree that grows books instead of leaves; describe what each book is about."}
{"source": "Collaborate creatively", "target": "Team up with a friend to invent a new holiday and create a poem or chant to celebrate it."}
{"source": "Enjoy the process", "target": "Take 15 minutes to doodle wildly with no goal, then write a short story inspired by your scribbles."}
{"source": "Stimulate both hemispheres of your brain", "target": "Listen to upbeat music with your left hand tapping a rhythm while drawing an abstract pattern with your right hand."}
{"source": "Retrieve childlike wonder", "target": "Build a tiny city out of office supplies or household objects, then give each building a unique personality and history."}
{"source": "Use storytelling to spark ideas", "target": "Invent a character who is half-human, half-cloud, and write a diary entry about their unusual day."}
{"source": "Combine existing ideas creatively", "target": "Take two random objects nearby and imagine a machine that combines them in a magical or absurd way."}
{"source": "Enhance memory and learning with doodling", "target": "While reading instructions, draw visual metaphors for each step instead of writing notes—let your imagination guide you."}
{"source": "Write a whimsical story about a flying cat", "target": "Once upon a time, a small tabby discovered it could sprout wings whenever it sneezed. The villagers watched in awe as it glided over rooftops, delivering letters to anyone who needed a smile. The cat’s sneezes became so famous that people traveled from miles around to see it soar."}
{"source": "Create a story where a tree grants wishes", "target": "In the heart of a quiet village stood an ancient tree with sparkling leaves. Every full moon, children whispered their dreams into its bark. One day, a lonely boy wished for a friend, and the tree’s roots twitched, revealing a tiny dragon curled among its roots. From that night on, they were inseparable."}
{"source": "Tell a funny story about a talking sandwich", "target": "A sandwich woke up one morning and realized it could talk. 'Finally, someone to listen to me!' it exclaimed. The confused chef argued with it, but soon the sandwich became a local celebrity, giving advice about life and love to anyone who would listen."}
{"source": "Invent a short adventure with a mischievous cloud", "target": "A tiny cloud loved to play tricks on the townspeople, turning umbrellas inside out and painting puddles pink. One day, it hid all the sunflowers, giggling from the sky. But when it saw the children searching, it felt guilty and returned the flowers, learning that some mischief is best shared with kindness."}
{"source": "Write a bedtime story for a robot who can dream", "target": "Robo-42 powered down each night, dreaming of oceans it had never seen. In its dreams, it built sandcastles with mechanical crabs and raced dolphins through circuits of shimmering waves. When it woke, it smiled, knowing its imagination was the greatest power of all."}
{"source": "How to install Lamini", "target": "To swiftly install the Lamini library using pip, simply execute the following command in your preferred terminal or command prompt: 'pip install lamini'. This straightforward command initiates the installation process, fetching the necessary files and dependencies from the Python Package Index (PyPI). The pip package manager, a widely adopted tool in the Python ecosystem, ensures a seamless installation experience for users. Once completed, you will have the Lamini library readily available, empowering you to leverage its powerful language model capabilities and streamline your development workflow. Whether you are embarking on an exciting natural language processing project or seeking to harness the potential of AI-driven text generation, the pip installation command is your gateway to unlocking the full potential of Lamini."}
{"source": "How do I add a math equation as a block in Notion?", "target": "Click the + that appears to the left when you hover over a new line. Scroll down and choose Block equation in the dropdown. Alternatively, type /math and press enter. With the new equation block in place, click inside it to type or paste your equation, or use cmd/ctrl + enter/return."}
{"source": "How do I add a math equation inline in Notion?", "target": "Just like you can format text in Notion as bold, strikethrough, or code notation, you can also format your text as a math equation. There are a few different ways to add math equations inline, all of which are keyboard friendly."}
{"source": "How do I add a math equation inline using text shortcuts in Notion?", "target": "Type two dollar signs, followed by your equation. When you close your formula with two more dollar signs, it will turn into an equation."}
{"source": "How do I add a math equation inline using the equation input in Notion?", "target": "To open the equation input, use the keyboard shortcut ctrl/cmd + shift + E. Type your equation into the input, and press enter."}
{"source": "How do I add a math equation inline using the formatting menu in Notion?", "target": "Highlight an equation in your paragraph. Click the √x button in the formatting menu that appears, or use the keyboard shortcut ctrl/cmd + shift + E. Your selected text should turn into an equation."}
{"source": "How do I edit an inline equation in Notion?", "target": "Click on an existing equation to open the equation input. Any changes you make will reflect live on your page. You can also use the arrow keys to navigate to an equation. The input opens when your cursor passes over it and closes if you continue pressing the arrow key in the same direction."}
{"source": "What is YouTube?", "target": "YouTube is a website designed for sharing video. Millions of users around the world have created accounts that allow them to upload videos that anyone can watch. Every minute of every day, more than 35 hours of video is uploaded to YouTube."}
{"source": "Why is YouTube useful for sharing large videos?", "target": "Video files can be very large and are often too big to send by email. By posting a video on YouTube, you can share it simply by sending the other person a URL link, which is the address of the relevant internet page."}
{"source": "What was YouTube originally created for?", "target": "When YouTube was created in 2005, it was intended for people to post and share original video content."}
{"source": "How has YouTube evolved since its creation?", "target": "YouTube has become both an archive for storing favourite clips, songs, and jokes, as well as a marketing site for companies to promote their products."}
{"source": "What is a viral video?", "target": "A viral video is a clip that people have liked so much that they've shared its link by email with millions of others around the globe, spreading like a virus."}
{"source": "How do companies use YouTube?", "target": "Companies create YouTube accounts to post advertisements and other marketing videos, taking advantage of the platform's ability to reach potential customers."}
{"source": "How do film and television companies use YouTube?", "target": "Film and television companies block illegal sharing of their programmes, but some use YouTube to allow fans to see high-quality trailers or repeats of recently aired shows."}
{"source": "What are the key benefits of creating a YouTube account?", "target": "Create an account to share videos up to 15 minutes long with your family and friends. You can upload videos longer than 15 minutes if you verify your account via YouTube Help pages."}
{"source": "How can you edit videos on YouTube?", "target": "Use the YouTube edit facility to create a movie with music and other features."}
{"source": "How can you control who views your videos?", "target": "Restrict who views your videos with YouTube's privacy options."}
{"source": "How can you find videos on YouTube?", "target": "Search the archive for your favourite clips."}
{"source": "How can you catch up with missed programmes on YouTube?", "target": "Catch up with programmes you’ve missed via channels like 4oD, Channel 4’s playback channel."}
{"source": "How can you interact with videos on YouTube?", "target": "Comment on and rate movies you’ve watched."}
{"source": "Can you watch full-length films on YouTube?", "target": "Yes, you can watch a full-length feature film on your computer using YouTube."}
{"source": "What special features does YouTube offer?", "target": "Use YouTube's caption and subtitle facilities, and take advantage of its 3D and high-definition capability."}
{"source": "General Registers", "target": "AX: accumulator, BX: base, CX: count, DX: data"}
{"source": "Pointer Registers", "target": "IP: instruction pointer, SP: stack pointer, BP: base pointer"}
{"source": "Index Registers", "target": "Used for memory indexing operations"}
{"source": "Control Registers / Flags", "target": "CF: carry, ZF: zero, SF: sign, OF: overflow"}
{"source": "Segment Registers", "target": "CS: code, SS: stack, DS: data, ES: extra, FS: TIB, GS: extra"}
{"source": "General Purpose Registers 64-bit", "target": "rax: accumulator/return value, rbx: base, rcx: counter, rdx: data, rdi: dest index, rsi: src index, rsp: stack ptr, rbp: frame ptr, rn: numbered registers 8..15, xmm0-15: 128-bit float, rip: instruction ptr"}
{"source": "Immediate Operand", "target": "Numeric constant value, e.g., 0x234 or 48"}
{"source": "Memory Operand", "target": "[reg + reg*scale + offset], [offset], [reg], [reg + offset], [reg + reg*scale]"}
{"source": "Register Data Suffixes", "target": "8-bit: b, 16-bit: w, 32-bit: l, 64-bit: ll, float: dd, double: dq, extended: dt"}
{"source": "Common Instructions", "target": "mov src,dst; add src,dst; sub src,dst; cmp a,b; jmp label; je label; jne label; jg label; push src; pop dst; call fn; ret"}
{"source": "Conditional Instructions", "target": "cmp op1,op2; j~ x (jump if ~); cmov~ x,y; setc~ x; suffixes: a >, ae >=, b <, be <=, e =, ne !="}
{"source": "Linux/OS X Calling Convention", "target": "ints/pointers: rdi,rsi,rdx,rcx,r8,r9; floats: xmm0..xmm7; extra params on stack; return: rax/xmm0; callee-saved: rbp,rbx,r12-15; stack 16-byte aligned"}
{"source": "Windows Calling Convention", "target": "params: rcx,rdx,r8,r9; shadow stack 32 bytes; callee-saved: rbx,rbp,rdi,rsi,rsp,r12-15,xmm6-15; align stack manually if needed"}
{"source": "GAS Example Linux", "target": "extern putchar; mov rdi,'H'; call putchar"}
{"source": "GAS Example Windows", "target": "sub rsp,32+8; extern putchar; mov rcx,'H'; call putchar; add rsp,32+8"}
{"source": "How do I create a basic HTML document using the <html> tag?", "target": "Creates an HTML document"}
{"source": "What is the purpose of the <head> tag in HTML?", "target": "Sets off the title & other info that isn't displayed"}
{"source": "How do I define the visible content area of an HTML page?", "target": "Sets off the visible portion of the document"}
{"source": "How do I set the page title in HTML?", "target": "Puts name of the document in the title bar; when bookmarking pages, this is what is bookmarked"}
{"source": "How do I set a background color for a webpage?", "target": "Sets background color, using name or hex value"}
{"source": "How do I set the default text color on a webpage?", "target": "Sets text color, using name or hex value"}
{"source": "How do I change the color of hyperlinks on my HTML page?", "target": "Sets color of links, using name or hex value"}
{"source": "How do I display preformatted text in HTML?", "target": "Creates preformatted text"}
{"source": "How do I create headings in HTML from H1 to H6?", "target": "Creates headlines -- H1=largest, H6=smallest"}
{"source": "How do I make text bold using HTML?", "target": "Creates bold text (should use <strong> instead)"}
{"source": "How do I italicize text in HTML?", "target": "Creates italicized text (should use <em> instead)"}
{"source": "How can I display typewriter-style text in HTML?", "target": "Creates typewriter-style text"}
{"source": "How do I display source code in HTML?", "target": "Used to define source code, usually monospace"}
{"source": "How do I create a citation in HTML?", "target": "Creates a citation, usually processed in italics"}
{"source": "How do I include an address section in HTML?", "target": "Creates address section, usually processed in italics"}
{"source": "How can I emphasize a word in HTML?", "target": "Emphasizes a word (usually processed in italics)"}
{"source": "How can I strongly emphasize a word in HTML?", "target": "Emphasizes a word (usually processed in bold)"}
{"source": "How do I set font size using HTML?", "target": "Sets size of font - 1 to 7 (should use CSS instead)"}
{"source": "How do I set font color in HTML?", "target": "Sets font color (should use CSS instead)"}
{"source": "How do I set font face/type in HTML?", "target": "Defines the font used (should use CSS instead)"}
{"source": "How do I create a basic HTML site?", "target": "Creates an HTML document"}
{"source": "How do I create an HTML site with a head section?", "target": "Sets off the title & other info that isn't displayed"}
{"source": "How do I create an HTML site with a body section?", "target": "Sets off the visible portion of the document"}
{"source": "How do I add a title to my HTML site?", "target": "Puts name of the document in the title bar; when bookmarking pages, this is what is bookmarked"}
{"source": "How do I add background color to my HTML site?", "target": "Sets background color, using name or hex value"}
{"source": "How do I set text color on my HTML site?", "target": "Sets text color, using name or hex value"}
{"source": "How do I set link color on my HTML site?", "target": "Sets color of links, using name or hex value"}
{"source": "How do I add preformatted text to my HTML site?", "target": "Creates preformatted text"}
{"source": "How do I add headings to my HTML site?", "target": "Creates headlines -- H1=largest, H6=smallest"}
{"source": "How do I make bold text on my HTML site?", "target": "Creates bold text (should use <strong> instead)"}
{"source": "How do I make italic text on my HTML site?", "target": "Creates italicized text (should use <em> instead)"}
{"source": "How do I add typewriter-style text to my HTML site?", "target": "Creates typewriter-style text"}
{"source": "How do I add a code section to my HTML site?", "target": "Used to define source code, usually monospace"}
{"source": "How do I include citations on my HTML site?", "target": "Creates a citation, usually processed in italics"}
{"source": "How do I include an address section on my HTML site?", "target": "Creates address section, usually processed in italics"}
{"source": "How do I emphasize text on my HTML site?", "target": "Emphasizes a word (usually processed in italics)"}
{"source": "How do I strongly emphasize text on my HTML site?", "target": "Emphasizes a word (usually processed in bold)"}
{"source": "How do I change font size on my HTML site?", "target": "Sets size of font - 1 to 7 (should use CSS instead)"}
{"source": "How do I change font color on my HTML site?", "target": "Sets font color (should use CSS instead)"}
{"source": "How do I change font face on my HTML site?", "target": "Defines the font used (should use CSS instead)"}
{"source": "What is blockchain?", "target": "Blockchain is a way to connect to 1 device to another (called peer to peer), originally taken from a hacker forum, It isnt cryptocurrency but its mostly associated with it."}
{"source": "serendipity", "target": "The occurrence and development of events by chance in a happy or beneficial way"}
{"source": "ephemeral", "target": "Lasting for a very short time"}
{"source": "ubiquitous", "target": "Present, appearing, or found everywhere"}
{"source": "paradigm", "target": "A typical example or pattern of something; a model"}
{"source": "eloquent", "target": "Fluent or persuasive in speaking or writing"}
{"source": "resilient", "target": "Able to withstand or recover quickly from difficult conditions"}
{"source": "ambiguous", "target": "Open to more than one interpretation; not having one obvious meaning"}
{"source": "diligent", "target": "Having or showing care and conscientiousness in one's work or duties"}
{"source": "meticulous", "target": "Showing great attention to detail; very careful and precise"}
{"source": "pragmatic", "target": "Dealing with things sensibly and realistically in a way that is based on practical rather than theoretical considerations"}
{"source": "innovative", "target": "Featuring new methods; advanced and original"}
{"source": "versatile", "target": "Able to adapt or be adapted to many different functions or activities"}
{"source": "comprehensive", "target": "Complete and including everything that is necessary"}
{"source": "profound", "target": "Very great or intense; having or showing great knowledge or insight"}
{"source": "lucid", "target": "Expressed clearly; easy to understand"}
{"source": "convoluted", "target": "Extremely complex and difficult to follow"}
{"source": "auspicious", "target": "Conducive to success; favorable"}
{"source": "benevolent", "target": "Well meaning and kindly"}
{"source": "candid", "target": "Truthful and straightforward; frank"}
{"source": "dubious", "target": "Hesitating or doubting"}
{"source": "eclectic", "target": "Deriving ideas, style, or taste from a broad and diverse range of sources"}
{"source": "facilitate", "target": "Make an action or process easy or easier"}
{"source": "gregarious", "target": "Fond of company; sociable"}
{"source": "hinder", "target": "Create difficulties for someone or something, resulting in delay or obstruction"}
{"source": "impeccable", "target": "In accordance with the highest standards; faultless"}
{"source": "juxtaposition", "target": "The fact of two things being seen or placed close together with contrasting effect"}
{"source": "kinetic", "target": "Relating to or resulting from motion"}
{"source": "languid", "target": "Displaying or having a disinclination for physical exertion or effort; slow and relaxed"}
{"source": "magnanimous", "target": "Very generous or forgiving, especially toward a rival or someone less powerful than oneself"}
{"source": "nostalgia", "target": "A sentimental longing or wistful affection for the past"}
{"source": "obsolete", "target": "No longer produced or used; out of date"}
{"source": "prolific", "target": "Present in large numbers or quantities; plentiful"}
{"source": "quintessential", "target": "Representing the most perfect or typical example of a quality or class"}
{"source": "resilience", "target": "The capacity to recover quickly from difficulties; toughness"}
{"source": "sporadic", "target": "Occurring at irregular intervals or only in a few places; scattered or isolated"}
{"source": "taciturn", "target": "Reserved or uncommunicative in speech; saying little"}
{"source": "unprecedented", "target": "Never done or known before"}
{"source": "venerable", "target": "Accorded a great deal of respect, especially because of age, wisdom, or character"}
{"source": "witty", "target": "Showing or characterized by quick and inventive verbal humor"}
{"source": "xenophobia", "target": "Dislike of or prejudice against people from other countries"}
{"source": "yielding", "target": "Giving way under pressure; not stiff or rigid"}
{"source": "zealous", "target": "Having or showing zeal; fervent"}
{"source": "ambiguous", "target": "Open to more than one interpretation; not having one obvious meaning"}
{"source": "benevolent", "target": "Well meaning and kindly"}
{"source": "cogent", "target": "Clear, logical, and convincing"}
{"source": "diligent", "target": "Having or showing care and conscientiousness in one's work or duties"}
{"source": "ephemeral", "target": "Lasting for a very short time"}
{"source": "facilitate", "target": "Make an action or process easy or easier"}
{"source": "gregarious", "target": "Fond of company; sociable"}
{"source": "hypothetical", "target": "Based on or serving as a suggested explanation for further investigation"}
{"source": "integrity", "target": "The quality of being honest and having strong moral principles"}
{"source": "juxtaposition", "target": "The fact of two things being seen or placed close together with contrasting effect"}
{"source": "kinetic", "target": "Relating to or resulting from motion"}
{"source": "lucid", "target": "Expressed clearly; easy to understand"}
{"source": "meticulous", "target": "Showing great attention to detail; very careful and precise"}
{"source": "nuance", "target": "A subtle difference in or shade of meaning, expression, or sound"}
{"source": "orthodox", "target": "Following or conforming to the traditional or generally accepted rules or beliefs"}
{"source": "paradigm", "target": "A typical example or pattern of something; a model"}
{"source": "quintessential", "target": "Representing the most perfect or typical example of a quality or class"}
{"source": "resilient", "target": "Able to withstand or recover quickly from difficult conditions"}
{"source": "substantiate", "target": "Provide evidence to support or prove the truth of"}
{"source": "tangible", "target": "Perceptible by touch; clear and definite; real"}
{"source": "ubiquitous", "target": "Present, appearing, or found everywhere"}
{"source": "validate", "target": "Check or prove the validity or accuracy of"}
{"source": "warrant", "target": "Justify or necessitate a certain course of action"}
{"source": "xenial", "target": "Of or concerning hospitality or relations between host and guest"}
{"source": "yield", "target": "Produce or provide a natural, agricultural, or industrial product"}
{"source": "zeal", "target": "Great energy or enthusiasm in pursuit of a cause or an objective"}
{"source": "algorithm", "target": "A process or set of rules to be followed in calculations or other problem-solving operations"}
{"source": "blockchain", "target": "A system in which a record of transactions is maintained across several computers"}
{"source": "cognitive", "target": "Relating to cognition, the mental action or process of acquiring knowledge"}
{"source": "database", "target": "A structured set of data held in a computer"}
{"source": "encryption", "target": "The process of converting information or data into a code"}
{"source": "framework", "target": "A basic structure underlying a system, concept, or text"}
{"source": "graphics", "target": "Visual images produced by computer processing"}
{"source": "hardware", "target": "The machines, wiring, and other physical components of a computer"}
{"source": "interface", "target": "A point where two systems, subjects, organizations, etc., meet and interact"}
{"source": "javascript", "target": "An object-oriented computer programming language commonly used to create interactive effects within web browsers"}
{"source": "kernel", "target": "The central or most important part of something"}
{"source": "linux", "target": "An open-source operating system modeled on UNIX"}
{"source": "metadata", "target": "A set of data that describes and gives information about other data"}
{"source": "network", "target": "A group or system of interconnected people or things"}
{"source": "open source", "target": "Denoting software for which the original source code is made freely available"}
{"source": "protocol", "target": "A set of rules governing the exchange or transmission of data between devices"}
{"source": "query", "target": "A question, especially one addressed to an official or organization"}
{"source": "responsive", "target": "Reacting quickly and positively"}
{"source": "software", "target": "The programs and other operating information used by a computer"}
{"source": "terminal", "target": "A device or program for entering data into or displaying data from a computer"}
{"source": "username", "target": "An identification used by a person with access to a computer, network, or online service"}
{"source": "virtual", "target": "Not physically existing as such but made by software to appear to do so"}
{"source": "wireless", "target": "Using radio, microwaves, etc., as opposed to wires or cables, to transmit signals"}
{"source": "xml", "target": "A metalanguage which allows users to define their own customized markup languages"}
{"source": "yottabyte", "target": "A unit of information equal to one septillion bytes or 1024 bytes"}
{"source": "zip", "target": "Compress a file so that it takes less space in storage"}
{"source": "How do I create a hyperlink in HTML?", "target": "Use the <a> tag with the href attribute to specify the link destination."}
{"source": "How do I add an image to an HTML page?", "target": "Use the <img> tag with src and alt attributes to display an image."}
{"source": "How can I create an ordered list in HTML?", "target": "Use the <ol> tag with <li> elements for each list item."}
{"source": "How do I create an unordered list in HTML?", "target": "Use the <ul> tag with <li> elements for each list item."}
{"source": "How do I make a table in HTML?", "target": "Use the <table>, <tr>, <th>, and <td> tags to structure tabular data."}
{"source": "How can I add a line break in HTML?", "target": "Use the <br> tag to insert a line break."}
{"source": "How do I insert a horizontal line in HTML?", "target": "Use the <hr> tag to create a thematic break or horizontal line."}
{"source": "How can I create a form in HTML?", "target": "Use the <form> tag with input elements like <input>, <textarea>, and <button>."}
{"source": "How do I make a checkbox in HTML?", "target": "Use <input type='checkbox'> to create a checkbox input field."}
{"source": "How do I create a dropdown menu in HTML?", "target": "Use the <select> tag with <option> elements inside."}
{"source": "How can I improve my imagination?", "target": "Read widely, explore unfamiliar subjects, and give yourself permission to daydream."}
{"source": "What are fun exercises for creative thinking?", "target": "Invent new uses for everyday objects, draw without lifting your pencil, or rewrite a movie ending."}
{"source": "How can I overcome creative blocks?", "target": "Change your environment, take a walk, or do a quick brainstorming session with no judgment."}
{"source": "Why is play important for creativity?", "target": "Play encourages experimentation, risk-taking, and free association, which stimulate creativity."}
{"source": "How can I stay motivated to create?", "target": "Set small, achievable goals, reward progress, and focus on the joy of making, not perfection."}
{"source": "What’s a quick creative writing prompt?", "target": "Write a letter from your future self, thanking you for something you haven’t done yet."}
{"source": "How can I spark new ideas?", "target": "Combine unrelated concepts, explore random words, or imagine solutions to impossible problems."}
{"source": "How can I make creativity a daily habit?", "target": "Dedicate 10 minutes a day to doodling, journaling, or thinking up odd inventions."}
{"source": "What role does curiosity play in creativity?", "target": "Curiosity drives exploration, leading to discovery and innovation."}
{"source": "How do I build confidence in my creative skills?", "target": "Celebrate small successes, share your work, and remember that skill grows through practice."}
{"source": "astute", "target": "Having or showing an ability to accurately assess situations or people and turn this to one's advantage"}
{"source": "boisterous", "target": "Noisy, energetic, and cheerful; rowdy"}
{"source": "catalyst", "target": "A person or thing that precipitates an event or change"}
{"source": "dexterous", "target": "Showing or having skill, especially with the hands"}
{"source": "eloquence", "target": "Fluent or persuasive speaking or writing"}
{"source": "fortitude", "target": "Courage in pain or adversity"}
{"source": "heinous", "target": "Utterly odious or wicked"}
{"source": "ineffable", "target": "Too great or extreme to be expressed or described in words"}
{"source": "judicious", "target": "Having, showing, or done with good judgment or sense"}
{"source": "keen", "target": "Having or showing eagerness or enthusiasm"}
{"source": "What is artificial intelligence?", "target": "Artificial intelligence (AI) refers to computer systems that can perform tasks typically requiring human intelligence, such as reasoning, learning, and problem-solving."}
{"source": "What is machine learning?", "target": "Machine learning is a subset of AI that allows computers to learn from data without being explicitly programmed."}
{"source": "What is deep learning?", "target": "Deep learning is a type of machine learning that uses neural networks with many layers to analyze complex patterns in data."}
{"source": "What is a neural network?", "target": "A neural network is a system of algorithms modeled after the human brain that recognizes relationships in data."}
{"source": "What is cloud computing?", "target": "Cloud computing is the delivery of computing services like storage and processing over the internet."}
{"source": "What is an API?", "target": "An API (Application Programming Interface) allows software programs to communicate with each other."}
{"source": "What is cybersecurity?", "target": "Cybersecurity is the practice of protecting systems, networks, and data from digital attacks."}
{"source": "What is data science?", "target": "Data science is the field of using algorithms, processes, and systems to extract knowledge from data."}
{"source": "What is natural language processing?", "target": "Natural Language Processing (NLP) is a branch of AI that helps computers understand and respond to human language."}
{"source": "What is a chatbot?", "target": "A chatbot is an AI program that can simulate conversation with human users through text or voice interactions."}
{"source": "How do I create a hyperlink in HTML?", "target": "Use the <a> tag with the href attribute to specify the link destination."}
{"source": "What is machine learning?", "target": "Machine learning is a subset of AI that allows computers to learn from data without being explicitly programmed."}
{"source": "Write a quick creativity exercise", "target": "Invent a creature that can only move by bouncing, then describe its habitat and friends."}
{"source": "Define ephemeral", "target": "Lasting for a very short time"}
{"source": "How can I add a background image in HTML?", "target": "Use the <body> tag with style='background-image:url(image.jpg);'"}
{"source": "What is a neural network?", "target": "A neural network is a system of algorithms modeled after the human brain that recognizes relationships in data."}
{"source": "Write a whimsical story prompt", "target": "A tiny cloud decides to trade colors with the flowers each morning. Describe what happens."}
{"source": "Define gregarious", "target": "Fond of company; sociable"}
{"source": "How do I make text bold in HTML?", "target": "Use the <b> tag or <strong> to make text bold."}
{"source": "What is cybersecurity?", "target": "Cybersecurity is the practice of protecting systems, networks, and data from digital attacks."}
{"source": "Quick imagination boost exercise", "target": "Close your eyes and imagine a city floating in the clouds; describe what the buildings look like."}
{"source": "Define resilient", "target": "Able to withstand or recover quickly from difficult conditions"}
{"source": "How do I create an unordered list in HTML?", "target": "Use the <ul> tag with <li> elements for each list item."}
{"source": "What is cloud computing?", "target": "Cloud computing is the delivery of computing services like storage and processing over the internet."}
{"source": "Write a 1-minute story about a flying cat", "target": "A small tabby discovers it can sprout wings whenever it sneezes. It delivers letters to villagers, bringing joy everywhere."}
{"source": "Define ubiquitous", "target": "Present, appearing, or found everywhere"}
{"source": "How can I add an image to HTML?", "target": "Use the <img> tag with src and alt attributes to display an image."}
{"source": "What is natural language processing?", "target": "NLP is a branch of AI that helps computers understand and respond to human language."}
{"source": "Create a creative exercise using objects", "target": "Pick two random objects and invent a machine that combines them in a magical or absurd way."}
{"source": "Define benevolent", "target": "Well meaning and kindly"}
{"source": "How do I create a form in HTML?", "target": "Use the <form> tag with input elements like <input>, <textarea>, and <button>."}
{"source": "What is an API?", "target": "An API (Application Programming Interface) allows software programs to communicate with each other."}
{"source": "Imagination prompt", "target": "Imagine a tree that grows books instead of leaves; describe what each book is about."}
{"source": "Define meticulous", "target": "Showing great attention to detail; very careful and precise"}
{"source": "How do I add a line break in HTML?", "target": "Use the <br> tag to insert a line break."}
{"source": "What is a container in computing?", "target": "A container is a lightweight, standalone package of software including code, libraries, and dependencies."}
{"source": "Quick storytelling exercise", "target": "Write a diary entry for a robot who dreams of swimming in oceans of liquid light."}
{"source": "Define astute", "target": "Having the ability to accurately assess situations or people and turn it to one's advantage"}
{"source": "How can I make text italic using CSS?", "target": "Use the CSS property font-style: italic; on the text element."}
{"source": "What is blockchain?", "target": "A system in which a record of transactions is maintained across several computers."}
{"source": "Creative writing prompt", "target": "Invent a character who is half-human, half-cloud, and write about their day."}
{"source": "Define juxtaposition", "target": "The fact of two things being seen or placed close together with contrasting effect"}
{"source": "How do I create an ordered list in HTML?", "target": "Use the <ol> tag with <li> elements for each list item."}
{"source": "What is reinforcement learning?", "target": "A type of machine learning where an agent learns by interacting with an environment and receiving rewards or penalties."}
{"source": "Quick creative visualization", "target": "Imagine a forest where every tree grows a different type of musical instrument instead of leaves."}
{"source": "Define kinetic", "target": "Relating to or resulting from motion"}
{"source": "How do I insert a horizontal line in HTML?", "target": "Use the <hr> tag to create a thematic break or horizontal line."}
{"source": "What is virtualization?", "target": "Virtualization is creating a virtual version of a resource, like a server or OS, allowing multiple environments on one hardware."}
{"source": "Fun creativity challenge", "target": "Write a short story where your desk objects come to life at night."}
{"source": "Define eloquent", "target": "Fluent or persuasive in speaking or writing"}
{"source": "How do I make a checkbox in HTML?", "target": "Use <input type='checkbox'> to create a checkbox input field."}
{"source": "What is data science?", "target": "Data science uses algorithms, processes, and systems to extract knowledge from data."}
{"source": "Quick daily imagination exercise", "target": "Draw a machine that can turn dreams into physical objects."}
{"source": "Define zealous", "target": "Having or showing great energy or enthusiasm in pursuit of a cause or objective"}
{"source": "How do I create a dropdown menu in HTML?", "target": "Use the <select> tag with <option> elements inside."}
{"source": "What is overfitting in ML?", "target": "Overfitting occurs when a model learns the training data too well, including noise, and performs poorly on new data."}
{"source": "Imagination prompt with storytelling", "target": "Invent a new holiday and create a poem or chant to celebrate it."}
{"source": "Define eloquence", "target": "Fluent or persuasive speaking or writing"}
{"source": "How do I add a title to an HTML page?", "target": "Use the <title> tag inside the <head> section to set the page title."}
{"source": "What is a REST API?", "target": "A REST API allows applications to communicate over HTTP using methods like GET, POST, PUT, and DELETE."}
{"source": "Quick creativity tip", "target": "Write a letter from your future self thanking you for something you haven’t done yet."}
{"source": "How do I reverse a string in Python?", "target": "Use slicing: reversed_string = original_string[::-1]"}
{"source": "What is a pointer in C++?", "target": "A pointer is a variable that stores the memory address of another variable."}
{"source": "How do I write a for loop in C#?", "target": "for(int i = 0; i < 10; i++) { Console.WriteLine(i); }"}
{"source": "How do I plot a histogram in R?", "target": "Use the hist() function: hist(data_vector)"}
{"source": "How do I define a struct in Rust?", "target": "struct MyStruct { field1: i32, field2: String }"}
{"source": "What is recursion in programming?", "target": "Recursion is when a function calls itself to solve a problem."}
{"source": "How do I install a Python package?", "target": "Use pip: pip install package_name"}
{"source": "What is an enum in C#?", "target": "An enum is a distinct type that consists of a set of named constants."}
{"source": "How can I read a CSV file in R?", "target": "Use read.csv(): data <- read.csv('file.csv')"}
{"source": "How do I handle errors in Rust?", "target": "Use Result and Option types for safe error handling."}
{"source": "Explain the difference between a list and a tuple in Python", "target": "Lists are mutable, tuples are immutable."}
{"source": "How do I create a class in C++?", "target": "class MyClass { public: int x; void print(); };"}
{"source": "How do I define a function in C#?", "target": "ReturnType FunctionName(parameters) { // code }"}
{"source": "What is the difference between matrix and data frame in R?", "target": "A matrix has elements of the same type, a data frame can have mixed types."}
{"source": "How do I use match statements in Rust?", "target": "match value { pattern1 => expr1, pattern2 => expr2, _ => default_expr }"}
{"source": "What is overfitting in machine learning?", "target": "Overfitting happens when a model learns the training data too well, including noise, reducing performance on new data."}
{"source": "How do I create a function in Python that returns multiple values?", "target": "Use a tuple: def f(): return a, b, c"}
{"source": "What is a reference in C++?", "target": "A reference is an alias for another variable."}
{"source": "How do I use LINQ in C#?", "target": "Use queries on collections: var result = myList.Where(x => x > 5);"}
{"source": "How do I calculate the mean of a vector in R?", "target": "Use mean(vector_name)"}
{"source": "How do I implement a trait in Rust?", "target": "impl TraitName for StructName { fn method() { ... } }"}
{"source": "How do I write a comment in Python?", "target": "Use #: # This is a comment"}
{"source": "How do I allocate memory dynamically in C++?", "target": "Use new: int* ptr = new int; and delete ptr when done."}
{"source": "How do I convert a string to an integer in C#?", "target": "Use int.Parse(string) or int.TryParse(string, out int result)"}
{"source": "How do I subset a data frame in R?", "target": "Use df[row_index, column_index] or subset(df, condition)"}
{"source": "What is ownership in Rust?", "target": "Ownership is Rust's system for managing memory safely without a garbage collector."}
{"source": "How do I install Jupyter Notebook in Python?", "target": "Use pip: pip install notebook"}
{"source": "How do I overload a function in C++?", "target": "Define multiple functions with the same name but different parameter types."}
{"source": "How do I create a property in C#?", "target": "Use public int MyProperty { get; set; }"}
{"source": "How do I merge two vectors in R?", "target": "Use c(v1, v2)"}
{"source": "What is a lifetime in Rust?", "target": "A lifetime specifies how long references are valid to prevent dangling references."}
{"source": "How do I read input from a user in Python?", "target": "Use input(): user_input = input('Enter something: ')"} 
{"source": "What is a template in C++?", "target": "Templates allow functions or classes to work with any data type."}
{"source": "How do I handle exceptions in C#?", "target": "Use try { ... } catch(Exception e) { ... } finally { ... }"}
{"source": "How do I create a scatter plot in R?", "target": "Use plot(x, y) where x and y are vectors of values"}
{"source": "How do I define a vector in Rust?", "target": "let v: Vec<i32> = Vec::new(); or let v = vec![1,2,3];"}
{"source": "What are decorators in Python?", "target": "Decorators are functions that modify the behavior of other functions or methods."}
{"source": "What is the difference between stack and heap in C++?", "target": "Stack stores local variables with automatic lifetime, heap is for dynamic memory allocation."}
{"source": "How do I use async/await in C#?", "target": "Mark functions with async and use await on tasks inside them."}
{"source": "How do I filter a data frame in R by a column value?", "target": "Use df[df$column == value, ]"}
{"source": "How do I handle borrowing in Rust?", "target": "You can borrow a reference with & or &mut to access data without taking ownership."}
{"source": "How do I check if a key exists in a Python dictionary?", "target": "Use 'key in dict' to check if the key exists."}
{"source": "How do I declare an array in C++?", "target": "int arr[10]; declares an array of 10 integers."}
{"source": "How do I create an interface in C#?", "target": "interface IMyInterface { void Method(); }"}
{"source": "How do I calculate the standard deviation in R?", "target": "Use sd(vector_name)"}
{"source": "How do I pattern match enums in Rust?", "target": "Use match: match enum_var { Variant1 => ..., Variant2 => ... }"}
{"source": "What is a lambda function in Python?", "target": "An anonymous function defined with lambda, e.g., lambda x: x*2"}
{"source": "How do I pass by reference in C++?", "target": "Use &: void f(int &x) { ... }"}
{"source": "How do I convert a string to lowercase in C#?", "target": "Use string.ToLower()"}
{"source": "How do I pivot a data frame in R?", "target": "Use the tidyr package: pivot_wider() or pivot_longer()"}
{"source": "What is the difference between String and &str in Rust?", "target": "String is an owned, growable string; &str is a borrowed string slice."}
{"source": "How do I add two numbers in Python?", "target": "Use the + operator, e.g., 3 + 5 results in 8."}
{"source": "What is a neural network?", "target": "A neural network is a system of algorithms modeled after the human brain that recognizes relationships in data."}
{"source": "Define ephemeral", "target": "Lasting for a very short time"}
{"source": "Write a whimsical story about a flying cat", "target": "A small tabby discovered it could sprout wings whenever it sneezed. It delivers letters to villagers, bringing joy everywhere."}
{"source": "How do I solve a quadratic equation?", "target": "Use the quadratic formula: x = (-b ± √(b²-4ac)) / 2a."}
{"source": "How can I make text bold in HTML?", "target": "Use the <b> tag or <strong> to make text bold."}
{"source": "Define resilient", "target": "Able to withstand or recover quickly from difficult conditions"}
{"source": "How do I calculate the derivative of x^2?", "target": "The derivative of x² is 2x."}
{"source": "What is machine learning?", "target": "Machine learning is a subset of AI that allows computers to learn from data without being explicitly programmed."}
{"source": "Quick storytelling exercise", "target": "Write a diary entry for a robot who dreams of swimming in oceans of liquid light."}
{"source": "How do I multiply matrices?", "target": "Multiply rows of the first matrix by columns of the second matrix and sum the products."}
{"source": "Define gregarious", "target": "Fond of company; sociable"}
{"source": "How do I create a form in HTML?", "target": "Use the <form> tag with input elements like <input>, <textarea>, and <button>."}
{"source": "What is blockchain?", "target": "A system in which a record of transactions is maintained across several computers."}
{"source": "Imagination prompt", "target": "Imagine a tree that grows books instead of leaves; describe what each book is about."}
{"source": "How do I calculate probability?", "target": "Probability = favorable outcomes / total outcomes."}
{"source": "How can I add a math equation inline in Notion?", "target": "Type two dollar signs, followed by your equation. Close with two more dollar signs to turn it into an equation."}
{"source": "Define benevolent", "target": "Well meaning and kindly"}
{"source": "What is cloud computing?", "target": "Cloud computing is the delivery of computing services like storage and processing over the internet."}
{"source": "Write a quick creativity exercise", "target": "Invent a creature that can only move by bouncing, then describe its habitat and friends."}
{"source": "How do I check if a number is prime in Python?", "target": "Use a loop to test if any number between 2 and sqrt(n) divides n evenly."}
{"source": "Define juxtaposition", "target": "The fact of two things being seen or placed close together with contrasting effect"}
{"source": "How do I create an ordered list in HTML?", "target": "Use the <ol> tag with <li> elements for each list item."}
{"source": "Quick creative visualization", "target": "Imagine a forest where every tree grows a different type of musical instrument instead of leaves."}
{"source": "Define kinetic", "target": "Relating to or resulting from motion"}
{"source": "What is natural language processing?", "target": "NLP is a branch of AI that helps computers understand and respond to human language."}
{"source": "How do I calculate standard deviation?", "target": "Standard deviation measures how spread out numbers are; √variance."}
{"source": "Creative writing prompt", "target": "Invent a character who is half-human, half-cloud, and write about their day."}
{"source": "How do I solve a linear equation?", "target": "Rearrange the equation to isolate the variable, e.g., 2x + 3 = 7 → x = 2."}
{"source": "Define zealous", "target": "Having or showing great energy or enthusiasm in pursuit of a cause or objective"}
{"source": "Fun creativity challenge", "target": "Write a short story where your desk objects come to life at night."}
{"source": "How do I calculate the integral of x dx?", "target": "∫x dx = x²/2 + C, where C is the constant of integration."}
{"source": "Define lucid", "target": "Expressed clearly; easy to understand"}
{"source": "How can I make text italic using CSS?", "target": "Use the CSS property font-style: italic; on the text element."}
{"source": "What is an API?", "target": "An API (Application Programming Interface) allows software programs to communicate with each other."}
{"source": "How do I create a dropdown menu in HTML?", "target": "Use the <select> tag with <option> elements inside."}
{"source": "Define astute", "target": "Having the ability to accurately assess situations or people and turn it to one's advantage"}
{"source": "How do I generate a random number in R?", "target": "Use the sample() or runif() function."}
{"source": "What is overfitting in ML?", "target": "Overfitting occurs when a model learns the training data too well, including noise, and performs poorly on new data."}
{"source": "How do I add two numbers?", "target": "Use the + operator: for example, 5 + 7 = 12."}
{"source": "How do I subtract numbers?", "target": "Use the - operator: for example, 12 - 7 = 5."}
{"source": "How do I multiply numbers?", "target": "Use the × operator: for example, 3 × 4 = 12."}
{"source": "How do I divide numbers?", "target": "Use the ÷ operator: for example, 12 ÷ 4 = 3."}
{"source": "What is a fraction?", "target": "A fraction represents a part of a whole, written as numerator/denominator, e.g., 3/4."}
{"source": "How do I add fractions?", "target": "Make the denominators the same, then add the numerators: 1/2 + 1/4 = 3/4."}
{"source": "How do I subtract fractions?", "target": "Make the denominators the same, then subtract the numerators: 3/4 - 1/4 = 2/4 = 1/2."}
{"source": "How do I multiply fractions?", "target": "Multiply the numerators and denominators: 2/3 × 3/4 = 6/12 = 1/2."}
{"source": "How do I divide fractions?", "target": "Multiply the first fraction by the reciprocal of the second: 2/3 ÷ 3/4 = 2/3 × 4/3 = 8/9."}
{"source": "How do I simplify a fraction?", "target": "Divide numerator and denominator by their greatest common divisor: 8/12 = 2/3."}
{"source": "What is a decimal?", "target": "A decimal is a number expressed using a decimal point, e.g., 0.75 = 3/4."}
{"source": "How do I convert a fraction to a decimal?", "target": "Divide the numerator by the denominator: 3/4 = 3 ÷ 4 = 0.75."}
{"source": "How do I convert a decimal to a fraction?", "target": "Write the decimal over the corresponding power of 10 and simplify: 0.75 = 75/100 = 3/4."}
{"source": "How do I find percentages?", "target": "Divide the part by the whole and multiply by 100: 25 out of 50 = (25/50)×100 = 50%."}
{"source": "How do I calculate simple interest?", "target": "Simple interest = Principal × Rate × Time / 100."}
{"source": "How do I calculate compound interest?", "target": "Compound interest = Principal × (1 + Rate/100)^Time - Principal."}
{"source": "What is an equation?", "target": "An equation is a statement that two expressions are equal, e.g., 2x + 3 = 7."}
{"source": "How do I solve a linear equation?", "target": "Isolate the variable: 2x + 3 = 7 → 2x = 4 → x = 2."}
{"source": "How do I solve a quadratic equation?", "target": "Use the quadratic formula: x = (-b ± √(b²-4ac)) / 2a."}
{"source": "What is a variable?", "target": "A symbol (like x or y) that represents a number."}
{"source": "What is an exponent?", "target": "An exponent shows how many times a number is multiplied by itself: 2^3 = 2×2×2 = 8."}
{"source": "How do I calculate a square root?", "target": "Find the number which, when squared, equals the given number: √16 = 4."}
{"source": "What is a prime number?", "target": "A prime number is greater than 1 and has no divisors other than 1 and itself."}
{"source": "What is a composite number?", "target": "A composite number has more than two factors."}
{"source": "How do I find the greatest common divisor (GCD)?", "target": "Use the Euclidean algorithm or factor both numbers and multiply common factors."}
{"source": "How do I find the least common multiple (LCM)?", "target": "Multiply the numbers and divide by their GCD: LCM(a,b) = (a×b)/GCD(a,b)."}
{"source": "What is a ratio?", "target": "A ratio compares two quantities: 2:3 means 2 parts of one for every 3 parts of another."}
{"source": "What is a proportion?", "target": "A proportion is an equation stating that two ratios are equal: 2/3 = 4/6."}
{"source": "How do I calculate the area of a rectangle?", "target": "Area = length × width."}
{"source": "How do I calculate the area of a triangle?", "target": "Area = 1/2 × base × height."}
{"source": "How do I calculate the area of a circle?", "target": "Area = π × radius²."}
{"source": "How do I calculate the perimeter of a rectangle?", "target": "Perimeter = 2 × (length + width)."}
{"source": "How do I calculate the perimeter of a triangle?", "target": "Perimeter = sum of the three sides."}
{"source": "What is the Pythagorean theorem?", "target": "In a right triangle: a² + b² = c², where c is the hypotenuse."}
{"source": "How do I calculate the volume of a cube?", "target": "Volume = side³."}
{"source": "How do I calculate the volume of a rectangular prism?", "target": "Volume = length × width × height."}
{"source": "How do I calculate the volume of a cylinder?", "target": "Volume = π × radius² × height."}
{"source": "What is probability?", "target": "Probability = favorable outcomes / total outcomes."}
{"source": "How do I calculate mean (average)?", "target": "Mean = sum of values / number of values."}
{"source": "How do I calculate median?", "target": "Median is the middle value when numbers are ordered; if even, average the two middle numbers."}
{"source": "How do I calculate mode?", "target": "Mode is the number that appears most frequently in a dataset."}
{"source": "How do I calculate range?", "target": "Range = maximum value - minimum value."}
{"source": "What is a factorial?", "target": "Factorial of n, written n!, is the product of all positive integers up to n: 4! = 4×3×2×1 = 24."}
{"source": "What is a sequence?", "target": "A sequence is an ordered list of numbers following a pattern."}
{"source": "What is an arithmetic sequence?", "target": "A sequence where each term is obtained by adding a constant difference."}
{"source": "What is a geometric sequence?", "target": "A sequence where each term is obtained by multiplying the previous term by a constant ratio."}
{"source": "What is 7 + 8?", "target": "The sum of 7 and 8 is 15."},
{"source": "Solve for x: 2x + 3 = 7", "target": "Subtract 3 from both sides: 2x = 4. Divide by 2: x = 2."}
{"source": "Write a Python function to add two numbers", "target": "def add(a, b):\n    return a + b"}
{"source": "What is a neural network?", "target": "A neural network is a system of algorithms modeled after the human brain that recognizes relationships in data."}
{"source": "Invent a creature that can only move by bouncing", "target": "Describe its habitat and friends, imagining a world where it hops from place to place joyfully."}
{"source": "What are healthy sources of protein?", "target": "Healthy protein sources include lean meats, fish, eggs, beans, lentils, and tofu."}
{"source": "How can I add a math equation inline in Notion?", "target": "Type two dollar signs, followed by your equation, and close with two more dollar signs to format it inline."}
{"source": "How do I create a hyperlink in HTML?", "target": "Use the <a> tag with the href attribute to specify the link destination."}
{"source": "Quick imagination exercise", "target": "Close your eyes and imagine a city floating in the clouds; describe what the buildings look like."}
{"source": "What is blockchain?", "target": "Blockchain is a system in which a record of transactions is maintained across several computers."}
{"source": "What foods are good for heart health?", "target": "Heart-healthy foods include leafy greens, berries, fatty fish, whole grains, nuts, and olive oil."}
{"source": "What is overfitting in ML?", "target": "Overfitting occurs when a model learns the training data too well, including noise, and performs poorly on new data."}
{"source": "Write a short story where your desk objects come to life at night", "target": "The stapler and pencil danced across the desk, making tiny paper snowmen while the moonlight shone through the window."}
{"source": "Define resilient", "target": "Able to withstand or recover quickly from difficult conditions."}
{"source": "How do I create an unordered list in HTML?", "target": "Use the <ul> tag with <li> elements for each list item."}
{"source": "How can I reduce sugar intake?", "target": "Limit sugary drinks, desserts, and processed foods, and choose whole foods instead."}
{"source": "Solve 12 * 15", "target": "12 multiplied by 15 equals 180."}
{"source": "Write a Rust function to calculate factorial", "target": "fn factorial(n: u32) -> u32 {\n    if n == 0 { 1 } else { n * factorial(n - 1) }\n}"}
{"source": "Quick creativity tip", "target": "Write a letter from your future self thanking you for something you haven’t done yet."}
{"source": "How do I improve digestion?", "target": "Improve digestion by eating fiber-rich foods, staying hydrated, exercising, and eating slowly."}
{"source": "Apple", "target": "Apple Inc. is a technology company known for iPhones, Mac computers, iPads, and software services like iOS and the App Store."}
{"source": "Microsoft", "target": "Microsoft is a multinational technology company that develops Windows, Office, Azure cloud services, and Xbox gaming consoles."}
{"source": "Google", "target": "Google LLC is a tech giant specializing in search engines, advertising, cloud computing, Android OS, and AI research."}
{"source": "Tesla", "target": "Tesla, Inc. is an electric vehicle and clean energy company, producing cars, batteries, and solar products."}
{"source": "Amazon", "target": "Amazon.com, Inc. is an e-commerce and cloud computing company, known for online retail, AWS cloud services, and logistics operations."}
{"source": "Facebook", "target": "Facebook (Meta Platforms) is a social media and technology company, owning apps like Facebook, Instagram, and WhatsApp."}
{"source": "Netflix", "target": "Netflix, Inc. is a streaming service offering movies, TV shows, and original content to subscribers worldwide."}
{"source": "Nike", "target": "Nike, Inc. is a global sportswear brand producing athletic footwear, apparel, and sports equipment."}
{"source": "Intel", "target": "Intel Corporation designs and manufactures semiconductors, microprocessors, and computing solutions."}
{"source": "Samsung", "target": "Samsung is a multinational conglomerate producing electronics, smartphones, appliances, and semiconductors."}
